fsharp.org
* FSharp For CSharp Developers

** Basics

*** Variables, Functions.. both?
F# is a functional language. Its often joked that _everything_ is an object in c#. IF that joke was made about f# it would be "everything is a function". So when we go to define a variable, which is commonplace in every language, it gets a little bit extra spicy in F#. Variables, under the hood, are functions. Below is a function called _x_ that always returns 10.
#+BEGIN_SRC fsharp
let x = 10
#+END_SRC
\begin{equation}
$f() = 10$
\end{equation}
Calling function 'x' returns 10. `x` is immutable, meaning it will always return 10 and cannot be changed. This makes sense if we think
