fsharp.tex
% Created 2022-11-01 Tue 19:36
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{John Doe}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={John Doe},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{FSharp For CSharp Developers}
\label{sec:org7bcede1}

\subsection{Basics}
\label{sec:orgf1f89af}

\subsubsection{Variables, Functions.. both?}
\label{sec:org2345b2a}
F\# is a functional language. Its often joked that \uline{everything} is an object in c\#. IF that joke was made about f\# it would be ``everything is a function''. So when we go to define a variable, which is commonplace in every language, it gets a little bit extra spicy in F\#. Variables, under the hood, are functions. Below is a function called \uline{x} that always returns 10.
\begin{verbatim}
let x = 10
\end{verbatim}
\begin{equation}
$f() = 10$
\end{equation}
Calling function 'x' returns 10. `x` is immutable, meaning it will always return 10 and cannot be changed. This makes sense if we think
\end{document}
